template/ceft-trans.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:iib="http://www.sampath.lk/SD/IIBFinacleIntegration/">
   <soapenv:Header/>
   <soapenv:Body>
      <iib:DoInterBankTransferRequest>
         <!--Optional:-->
         <APPCode>VSW</APPCode>
         <!--Optional:-->
         <Controller>CMN</Controller>
         <!--Optional:-->
         <CDCICode>F</CDCICode>
         <!--Optional:-->
         <TerminalID></TerminalID>
         <!--Optional:-->
         <CardNo></CardNo>
         <FromAccNo>{{.FromAcc}}</FromAccNo>
         <!--Optional:-->
         <FromAccType></FromAccType>
         <!--Optional:-->
         <FromAccBankCode>{{.FromBankCode}}</FromAccBankCode>
         <!--Optional:-->
         <FromAccBranchCode></FromAccBranchCode>
         <ToAccNo>{{.ToAcc}}</ToAccNo>
         <!--Optional:-->
         <ToAccName></ToAccName>
         <!--Optional:-->
         <ToAccType></ToAccType>
         <ToAccBankCode>{{.ToBankCode}}</ToAccBankCode>
         <!--Optional:-->
         <ToAccBranchCode></ToAccBranchCode>
         <TxnAmount>{{.Amount}}</TxnAmount>
         <CommAmount>{{.Commission}}</CommAmount>
         <!--Optional:-->
         <CommAccount>{{.CommissionAcc}}</CommAccount>
         <!--Optional:-->
         <TranRemarks></TranRemarks>
         <!--Optional:-->
         <ValueDate>{{.Date}}</ValueDate>
         <!--Optional:-->
         <SlipsCode></SlipsCode>
         <!--Optional:-->
         <DrCurrencyCode>LKR</DrCurrencyCode>
         <!--Optional:-->
         <ChannelType></ChannelType>
         <CEFTFlag>Y</CEFTFlag>
         <FromAccName></FromAccName>
         <!--Optional:-->
         <Reference>{{.Memo}}</Reference>
      </iib:DoInterBankTransferRequest>
   </soapenv:Body>
</soapenv:Envelope>
